## Add/Remove Rows and Columns FRom DataFrames

In [11]:
people = {
    "first": ["Corey", "Jane", "John"],
    "last": ["Schafer", "Doe", "Doe"],
    "email": ["CoreyMSchafer@gmail.com", "JaneDoe@email.com", "JohnDoe@email.com"]
}

In [12]:
import pandas as pd

In [13]:
df = pd.DataFrame(people)
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [14]:
df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [15]:
df['full_name'] = df['first'] + ' ' + df['last']
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

In [16]:
df.drop(columns=['first', 'last'], inplace=True)
df

                     email      full_name
0  CoreyMSchafer@gmail.com  Corey Schafer
1        JaneDoe@email.com       Jane Doe
2        JohnDoe@email.com       John Doe

In [18]:
df['full_name'].str.split(' ', expand=True) # expand=True will return a dataframe instead of a series

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [20]:
df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)
df

                     email      full_name  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  Corey  Schafer
1        JaneDoe@email.com       Jane Doe   Jane      Doe
2        JohnDoe@email.com       John Doe   John      Doe

#### `append` method was deprecated in pandas, so it is not recommended to use it. Use `concat` instead

In [26]:
people = {
    "first": ["Tony", "Steve"],
    "last": ["Stark", "Rogers"],
    "email": ["123@gmail.com", "333@email.com"]
}
df2 = pd.DataFrame(people)
df2

   first    last          email
0   Tony   Stark  123@gmail.com
1  Steve  Rogers  333@email.com

In [27]:
df2.drop(index=0)

   first    last          email
1  Steve  Rogers  333@email.com

In [32]:
df2 = pd.DataFrame(people)
filt = (df2['first'] == 'Steve')
df2.drop(index=df2[filt].index)

  first   last          email
0  Tony  Stark  123@gmail.com